Revit 2027 API
RebarConstraintsManager.GetCurrentConstraintOnHandle Method
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraint GetCurrentConstraintOnHandle(
	RebarConstrainedHandle handle
)
Public Function GetCurrentConstraintOnHandle (
	handle As RebarConstrainedHandle
) As RebarConstraint
public:
RebarConstraint^ GetCurrentConstraintOnHandle(
	RebarConstrainedHandle^ handle
)
member GetCurrentConstraintOnHandle :
        handle : RebarConstrainedHandle -> RebarConstraint
Parameters
handle RebarConstrainedHandle
Return Value
RebarConstraint
Exceptions
Exception | Condition
ArgumentException |  handle is no longer valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace